#include <iostream>
#include <string>
#include <windows.h>
using namespace std;

//----------------------------------------------------------------------------------

//int main()
//{
//	const int SIZE = 5;
//	int ar[SIZE] = { 40, 20, 50, 35, 71 };
//	// int* ptr = ar; // в покажчик потрапить базова адреса масиву
//	int* ptr = &ar[0]; // тут так само
//	//cout << (long long int)ptr << "\n";
//	//cout << (long long int)ar << "\n";
//	//cout << (long long int)&ar[0] << "\n";
//	//ptr++;
//	//cout << (long long int)ptr << "\n";
//	// для покажчика типу інт зсув буде вправо на 4 байти (це розмір інта)
//	// для покажчика типу шорт зсув буде вправо на 2 байти (це розмір шорта)
//	// для покажчика типу дабл зсув буде вправо на 8 байти (це розмір дабла)
//	// для покажчика типу чар зсув буде вправо на 1 байт (це розмір чара)
//	//ptr++;
//	//cout << (long long int)ptr << "\n";
//	cout << "\n";
//	for (int i = 0; i < SIZE; i++)
//	{
//		// cout << ar[i] << ", ";
//		cout << (long long int)ptr << "\n";
//		cout << *ptr << "\n";
//		ptr++; // перехід на наступний елемент масиву
//		// ar++; // назва масиву без квадратних дужок - це покажчик на базову адресу масиву (тобто його нульовий елемент), але цей покажчик - константа, тому операції ++ або -- до нього не можна пристосувати
//	}
//	cout << "\n";
//}

//----------------------------------------------------------------------------------

//int main()
//{
//	const int SIZE = 5;
//	int ar[SIZE] = { 40, 20, 50, 35, 71 };
//	// int* ptr = ar; // в покажчик потрапить базова адреса масиву
//	int* ptr = &ar[0]; // тут так само
//	//cout << (long long int)ptr << "\n";
//	//cout << (long long int)ar << "\n";
//	//cout << (long long int)&ar[0] << "\n";
//	//ptr++;
//	//cout << (long long int)ptr << "\n";
//	// для покажчика типу інт зсув буде вправо на 4 байти (це розмір інта)
//	// для покажчика типу шорт зсув буде вправо на 2 байти (це розмір шорта)
//	// для покажчика типу дабл зсув буде вправо на 8 байти (це розмір дабла)
//	// для покажчика типу чар зсув буде вправо на 1 байт (це розмір чара)
//	//ptr++;
//	//cout << (long long int)ptr << "\n";
//	cout << "\n";
//	for (int i = 0; i < SIZE; i++)
//	{
//		cout << ar[i] << ", ";
//		cout << *(ar + i) << ", ";
//		// ar - базова адреса масиву, наприклад :500
//		// ar + 2 == відбудеться зсув на 2 елементи типу елементів масиву, :500 + 2 * sizeof(int), :500 + 2 * 4 == :508
//		// *:508 = операція взяття вмісту (розадресація) дозволить отримати доступ на читання та запис 2 елементу масиву
//	}
//	cout << "\n";
//}

//----------------------------------------------------------------------------------

//int main()
//{
//	const int SIZE = 5;
//	int ar[SIZE] = { 40, 20, 50, 35, 71 };
//	int* ptr = ar;
//	cout << ptr[2] << "\n";
//	// *(ptr + 2)
//	cout << 2[ptr] << "\n";
//	// *(2 + ptr)
//
//
//
//	cout << "\n";
//	for (int i = 0; i < SIZE; i++)
//	{
//	}
//	cout << "\n";
//}

//----------------------------------------------------------------------------------

//Якщо одним з операндів операції додавання є покажчик, то іншим операндом обов'язково має бути вираз ЦІЛОГО типу.
//
//const int SIZE = 5;
//int ar[SIZE] = { 40, 20, 50, 35, 71 };
//int* ptr = ar;
//cout << ptr - 2 << "\n"; // OK
//cout << 2 - ptr << "\n"; // ERROR
//
//Лівим операндом операції віднімання може бути покажчик, але правим тоді має бути вираз ЦІЛОГО типу, або покажчик такого ж типу.

//-----------------------------------------------------------------------------------

//int* ar = new int[5] {1, 2, 3, 4, 5};
//int* ptr = &ar[2];
//cout << ptr - ar << "\n";
////double* test = nullptr;
////cout << ptr - test << "\n"; //error

//-----------------------------------------------------------------------------------

//int main()
//{
//	const char* str = "Alexander"; // рядок (string)
//	const char* search = "and"; // підрядок (substring)
//	// strstr - search substring in big string
//	const char* result = strstr(str, search);
//	cout << result << "\n"; // :504
//	cout << result - str << "\n"; // :504 - :500 = 4
//}

//-----------------------------------------------------------------------------------

//int main()
//{
//	int x = 10;
//	int& ref = x; // reference
//	ref = 20; // x = 20
//	cout << x << "\n"; // 20
//	x = 30; // ref = 30
//	cout << ref << "\n"; // 30 
//}

//-----------------------------------------------------------------------------------

//void test(int value) {
//	value = 50;
//}
//
//int main()
//{
//	int x = 10; // оригінал змінної створено в одній функції
//	test(x); // передача аргумента за значенням (відбувається копіювання ЗНАЧЕННЯ)
//	cout << x << "\n"; // 50
//}

//-----------------------------------------------------------------------------------

//int test(int value) {
//	value = 50;
//	return value;
//}
//
//int main()
//{
//	int x = 10; // оригінал змінної створено в одній функції
//	x = test(x); // передача аргумента за значенням (відбувається копіювання ЗНАЧЕННЯ)
//	cout << x << "\n"; // 50
//}

//-----------------------------------------------------------------------------------

//void test(int* ptr) {
//	*ptr = 50;
//}
//
//int main()
//{
//	int x = 10; // оригінал змінної створено в одній функції
//	test(&x); // передача аргумента за покажчиком (передається адреса оригінала)
//	cout << x << "\n"; // 50
//}

//-----------------------------------------------------------------------------------

// параметр-посилання (ссылка)	
//void test(int& ref) {
//	ref = 50;
//}
//
//int main()
//{
//	int x = 10; // оригінал змінної створено в одній функції
//	test(x); // передача аргумента за посиланням (передається адреса оригінала, але за спрощенним синтаксисом)
//	cout << x << "\n"; // 50
//}

//-----------------------------------------------------------------------------------

//З точки зору програміста, при оголошенні посилання, задається альтернативний ідентифікатор для вже створеного об'єкта.
//З точки зору реалізації, посилання — це вказівник, який жорстко прив'язаний до області пам'яті, на яку він вказує,
//і який автоматично розіменовується при зверненні через ім'я посилання

//-----------------------------------------------------------------------------------

//int x = 10; // оригінал змінної створено в одній функції
//int& ref = x;
//cout << &x << "\n";
//cout << &ref << "\n";

//-----------------------------------------------------------------------------------

//int main()
//{
//	cout << "Alex\0ander" << "\n";
//	// \0 - слеш-нуль, нуль-термінатор, символ з кодом нуль (по кодовій таблиці ASCII)
//}

//-----------------------------------------------------------------------------------

//Рядок — це послідовність  
//з одного або більше символів, де останнім елементом послідовності є символ з кодом 0.

//-----------------------------------------------------------------------------------

//int main()
//{
//	// "Alex" - тільки виглядає просто :)
//	// в пайтоні це був би об'єкт класу з типом Str
//	// в С++ будь-який рядковий літерал на рівні пам'яті реалізується як одновимірний масив чарів, що завершується \0
//	char name[5] = { 'A', 'l', 'e', 'x', '\0' };
//	cout << name << "\n"; // Alex - сіаут за замовчуванням роздруковує масив чарів як рядок (це виключення, для всіх інших масивів буде показана їх базова адреса)
//	int numbers[5] = { 11,22,33,44,55 };
//	cout << numbers << "\n"; // 000000B3F4EFF628
//}

//-----------------------------------------------------------------------------------

//int main()
//{
//	// приклад динамічного масиву чарів
//	int size;
//	cin >> size;
//	char* str = new char[size];
//}

//-----------------------------------------------------------------------------------

//int main()
//{
//	setlocale(0, "");
//	// cout << "Володимиренклименжільєнко-Громинревинградинтеменко Бронівогневладислав Едуардолеонардоконстантинослав";
//	// cout << "Крун Тхеп Маханахон Амон Ратанакосін Махінтараютхая Махадлок Пхоп Нопарат Рачатані Бурірам Удомратчаніве Махасатан Амон Піма Авата Саті Сакатхаттійя Вітсанукам Праса";
//	char* city = new char[350]; // зазвичай, 50 символів вистачає :)
//	// як присвоїти рядку певне значення?
//	// city = "Odesa"; // ERROR! "Odesa" - це рядковий літерал (константа), і щоб записати адресу цієї константи в покажчик, то і покажчик має бути константним!
//	strcpy_s(city, 5, "Odesa"); // city = "Odesa"
//	cout << city << "\n";
//	// як скопіювати рядок?
//	// як об'єднати два рядка?
//	// як дізнатися довжину рядка?
//	delete[] city;
//	// string name = "Alex";
//}

//-----------------------------------------------------------------------------------

//int main()
//{
//	setlocale(0, "");
//	// cout << "Володимиренклименжільєнко-Громинревинградинтеменко Бронівогневладислав Едуардолеонардоконстантинослав";
//	// cout << "Крун Тхеп Маханахон Амон Ратанакосін Махінтараютхая Махадлок Пхоп Нопарат Рачатані Бурірам Удомратчаніве Махасатан Амон Піма Авата Саті Сакатхаттійя Вітсанукам Праса";
//	char* city = new char[350]; // зазвичай, 50 символів вистачає :)
//	// як присвоїти рядку певне значення?
//	// city = "Odesa"; // ERROR! "Odesa" - це рядковий літерал (константа), і щоб записати адресу цієї константи в покажчик, то і покажчик має бути константним!
//	strcpy_s(city, 6, "Odesa"); // city = "Odesa"
//	cout << city << "\n";
//	char* copy = new char[10];
//	// copy = city; // нажаль, в С++ для покажчиків = працює як копіювання АДРЕСИ, а не контенту
//	strcpy_s(copy, 6, city);
//	cout << copy << "\n";
//	// як скопіювати рядок?
//	// як об'єднати два рядка?
//	// як дізнатися довжину рядка?
//	delete[] city;
//	// string name = "Alex";
//}

//-----------------------------------------------------------------------------------
int main() {
    string text;
    cout << "Enter a line of text: ";
    getline(cin, text);

    int count = 0;
    cout << "Indices of the letter 'O' or 'o': ";
    for (int i = 0; i < text.length(); i++) {
        if (text[i] == 'О' || text[i] == 'о') {
            cout << i << " ";
            count++;
        }
    }

    cout << "\nThe number of letters 'O' or 'o': " << count << "\n";

    return 0;
}
